<?php
/**
 * FAQseite
 */
/**Copyright (C) 2013  Christian Ehringfeld, David Mock, Matthias Unterbusch
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * any later version.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>
 */
/* @var $this SiteController */
$this->pageTitle=Yii::app()->name . ' - FAQ';
$this->breadcrumbs=array(	'FAQ',);
?>


<div class=&quot;row&quot;>
    <h2 class='subheader'>FAQ</h2>
    <hr>
    <div class=&quot;twelve columns&quot;>
            <p> <b>Fragen:</b><br>
                <br>
                1. Wie registriere ich mich?<br>
                2. Was mache ich, wenn ich mein Passwort vergessen habe?<br>
                3. Wie kann ich Sch&uuml;ler hinzuf&uuml;gen?<br>
                4. Wie kann ich meine Benutzerdaten &auml;ndern?<br>
                5. Wie kann ich einen Termin vereinbaren?<br>
                6. Wie kann ich einen Termin l&ouml;schen? (Eltern)<br>
                7. Wie kann ich einen Termin l&ouml;schen? (Lehrer)<br>
                8. Wie kann ich meine Termine drucken?<br>
                9. Wie kann ich die Schule kontaktieren?<br>
            </p>
            <p> <b>Antworten:</b><br>
                <br>
                1. Wie registriere ich mich?<br><br>
                Sie k&ouml;nnen sich registrieren, wenn Sie auf der Hauptseite auf den Schriftzug &bdquo;Ben&ouml;tigen Sie einen Zugang?
                Klicken Sie hier.&ldquo; anklicken.<br>
                Auf dieser Seite m&uuml;ssen Sie alle Felder ausf&uuml;llen. Bei der Angabe der E-Mail-Adresse ist es wichtig,
                eine g&uuml;ltige Adresse einzutragen, da &uuml;ber diese ein Aktivierungslink verschickt wird. Das Passwort muss
                dabei mindestens acht Zeichen umfassen und einmal wiederholt werden. Vom Klassenlehrer Ihres Kindes
                erhalten Sie eine TAN (Kennziffer), die aus sechs Zahlen besteht.<br>
                Nachdem Sie alle Felder ausgef&uuml;llt haben, m&uuml;ssen Sie auf den Button mit der Aufschrift &bdquo;Registrieren&ldquo; klicken.<br>
                Danach erhalten Sie eine E-Mail, die einen Registrierungslink beinhaltet. Wenn diese E-Mail eingetroffen
                ist, m&uuml;ssen Sie den mitgeschickten Link anklicken. Anschlie&szlig;end k&ouml;nnen Sie sich mit Ihrer E-Mailadresse und dem von Ihnen festgelegten Passwort auf der Hauptseite einloggen.<br>
                <br>
                2. Was mache ich, wenn ich mein Passwort vergessen habe?<br><br>
                Wenn Sie Ihr Passwort vergessen haben, m&uuml;ssen Sie auf der Startseite den Schriftzug &bdquo;Passwort vergessen?&ldquo; anklicken.<br>
                Daraufhin erscheint eine Seite, bei der Sie Ihre E-Mail-Adresse und den angezeigten Sicherheitscode
                eingeben m&uuml;ssen. Wenn beide Felder ausgef&uuml;llt wurden, m&uuml;ssen Sie auf &bdquo;Absenden&ldquo; klicken.<br>
                Danach erhalten Sie erneut eine E-Mail, die einen Link enth&auml;lt, den Sie anklicken m&uuml;ssen. Anschlie&szlig;end
                werden Sie auf eine Seite weitergeleitet, auf der Sie ein neues Passwort festgelegen k&ouml;nnen. Danach k&ouml;nnen
                Sie sich wieder auf der Hauptseite mit Ihrer E-Mailadresse und dem neuem Passwort einloggen.<br>
                <br>
                3. Wie kann ich Sch&uuml;ler hinzuf&uuml;gen?<br><br>
                Klicken Sie den Men&uuml;button &bdquo;Ihre Kinder&ldquo;, danach auf den Button &bdquo;Sch&uuml;ler hinzuf&uuml;gen&ldquo;. Anschlie&szlig;end m&uuml;ssen
                Sie den Vor- und Nachnamen Ihres Kindes eingeben und auf &bdquo;Anlegen&ldquo; klicken.<br>
                <br>
                4. Wie kann ich meine Benutzerdaten &auml;ndern?<br><br>
                Um Ihre Benutzerdaten zu &auml;ndern, klicken Sie zun&auml;chst im Men&uuml; auf &bdquo;Ihr Account&ldquo; und danach auf den Button
                &bdquo;Benutzer bearbeiten&ldquo;. Anschlie&szlig;end k&ouml;nnen Sie Ihre Benutzerdaten &auml;ndern. Um die &Auml;nderungen zu speichern,
                m&uuml;ssen Sie auf den Button &bdquo;Speichern&ldquo; klicken.<br>
                <br>
                5. Wie kann ich einen Termin vereinbaren?<br><br>
                Um einen Terminen auszumachen, m&uuml;ssen Sie auf den Men&uuml;button &bdquo;Termin festlegen&ldquo; klicken. Um sich Lehrer
                mit einem bestimmten Anfangsbuchstaben anzeigen zu lassen, klicken Sie dann auf diesen Buchstaben. Danach
                k&ouml;nnen Sie den Lehrer in der erscheinenden Liste direkt ausw&auml;hlen, indem Sie das kleine Weckersymbol klicken.
                Alternativ k&ouml;nnen Sie in dem Textfeld die Anfangsbuchstaben des gew&uuml;nschten Lehrers eingeben und diesen
                im sich &ouml;ffnendem Men&uuml; anklicken.<br>
                Wenn Sie einen Lehrer ausgew&auml;hlt haben, erscheint dessen Zeitplan. In diesem sind die Termine entweder
                als &bdquo;VERF&Uuml;GBAR&ldquo; oder &bdquo;BELEGT&ldquo; gekennzeichnet. Durch das Klicken auf einen Termin, der als &bdquo;VERF&Uuml;GBAR&ldquo;
                gekennzeichnet ist, werden f&uuml;r Sie automatisch das Datum und die Uhrzeit des angeklickten Termins in die
                untenstehenden Felder eingetragen. Falls mehr als ein Kind die Schule besucht, m&uuml;ssen Sie den Namen des
                jeweiligen Kindes ausw&auml;hlen.<br>
                Zum Schluss m&uuml;ssen Sie auf den Button &bdquo;Best&auml;tigen&ldquo; klicken, um den Termin zu reservieren.<br>
                <br>
                6. Wie kann ich einen Termin l&ouml;schen? (Eltern)<br><br>
                Sie k&ouml;nnen Termine l&ouml;schen, indem Sie im Men&uuml; auf den Button &bdquo;Ihre Termine&ldquo; klicken. Au&szlig;erdem ist die Seite
                &bdquo;Ihre Termine&ldquo; auch nach dem Login direkt ge&ouml;ffnet. Ein Termin kann gel&ouml;scht werden, indem Sie auf den
                Button &bdquo;Termin l&ouml;schen&ldquo; klicken.<br>
                <br>
                7. Wie kann ich einen Termin l&ouml;schen? (Lehrer)<br><br>
                Sie k&ouml;nnen Termine l&ouml;schen, indem Sie im Men&uuml; auf den Button &bdquo;Ihre Termine&ldquo; klicken. Au&szlig;erdem ist die Seite
                &bdquo;Ihre Termine&ldquo; auch nach dem Login direkt ge&ouml;ffnet. Ein Termin kann gel&ouml;scht werden, indem Sie auf das
                kleine M&uuml;lleimersymbol klicken und die Sicherheitsfrage mit &bdquo;OK&ldquo; best&auml;tigen.<br>
                <br>
                8. Wie kann ich meine Termine drucken?<br><br>
                Zum Drucken m&uuml;ssen Sie im Men&uuml; auf &bdquo;Ihre Termine&ldquo; klicken, um die entsprechende Seite aufzurufen. Au&szlig;erdem
                wird die Seite direkt nach dem Login angezeigt.<br>
                Wenn Sie auf den Button mit der Aufschrift &bdquo;Ducken&ldquo; klicken, erscheint ein weiteres Fenster, bei dem Sie
                Drucker auszuw&auml;hlen m&uuml;ssen. Danach m&uuml;ssen Sie in dem neuen Fenster auf den Button &bdquo;Drucken&ldquo; klicken,
                um die Terminliste auszudrucken.<br>
                <br>
                9. Wie kann ich die Schule kontaktieren?<br><br>
                Falls Fragen zu der Elternsprechtags-Software bestehen sollten, k&ouml;nnen Sie auf der Startseite den Link
                &bdquo;Kontakt&ldquo; anklicken. Danach erscheint eine Seite, bei der Sie die Ihren Namen, Ihre E-Mailadresse und
                einen Betreff eingeben m&uuml;ssen. Au&szlig;erdem muss eine Nachricht geschrieben werden, in der Sie Ihr Anliegen
                darlegen k&ouml;nnen. Wenn Sie alle Felder ausgef&uuml;llt haben, m&uuml;ssen Sie abschlie&szlig;end den Sicherheitscode
                eingeben und auf &bdquo;Absenden&ldquo; klicken.<br><br>
          </p>
    </div>
</div>
